public_html/ML/06.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="it" xml:lang="it">
<head>
<!-- 2022-03-31 gio 16:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ML - Lesson 06</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Alessandro Straziota" />
<link rel="stylesheet" href="/appunti.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">ML - Lesson 06</h1>
<div id="table-of-contents">
<h2>Indice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga7b214b">Approcci Probabilistici</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga7b214b" class="outline-2">
<h2 id="orga7b214b">Approcci Probabilistici</h2>
<div class="outline-text-2" id="text-orga7b214b">
<p>
Fin ora abbiamo visto approcci funzionali, in cui il predittore è una <b>funzione</b> che associa degli oggetti a dei valori target.
L'altro approccio noto è invece quello ricercare una <b>distribuzione</b> \(p(y \vert x)\) che approssima al meglio la distribuzione \(p_{\mathscr{D}_2}(y \vert x)\).
</p>

<p>
Recap:
</p>
<ul class="org-ul">
<li>campioniamo di punti \(x\) nel dataset con la probabilità \(p_{\mathscr{D}_1}(x)\), che d'ora in poi assumeremo per semplicità <b>uniforme</b>.</li>
<li>fissato un oggetto \(x\), sappiamo che esso assume un valore di target \(y\) con probabilità \(p_{\mathscr{D}_2}(y \vert x)\).</li>
</ul>

<p>
L'approccio è identico a contesto funzionale.
Perciò definiamo una classe di distribuzioni condizionali, e cerchiamo di inferire a partire dai dati la migliore distribuzione condizionale \(p^*\) che si avvicina di più a \(p_{d2}\).<br />
</p>

<p>
In fine, definiamo una <b>strategia di decisione</b>, che data la distribuzione del nostro modello, estrate una predizione finale.<br />
</p>

<p>
Come sempre, paremetriziamo le distribuzioni della nostra classe, e cerchiamo il vettore di parametri che ci ottimizza la relativa distribuzione.<br />
</p>


<p>
La qualità della distribuzione dato un dataset \(T\) è la cosidetta <i>likelyhood</i> (<i>verosimiglianza</i>).
</p>

<hr />
<hr />

<p>
Con l'approccio probabilistico, si vuole predire una <b>distribuzione</b> sulla probabilità che un dato oggetto abbia un dato target.
Sappiamo che esiste una reale distribuzione \(p(y|x)\), che generalmente <b>non conosciamo</b>.
</p>

<p>
Come prima cosa assumiamo che nel nostro training set \(T\), il target \(t_i\) associato all'oggetto \(x_i\) sia la sua media, ovvero
\[
  \mathbb{E} \left[ x_i \right] = t_i
  \]
</p>

<p>
Dopodiché, necessitiamo di paragonare una distribuzione \(h\) del nostro predittore con quella reale \(p\).
Non conoscendo \(p\), <b>assumiamo</b> che \(p\) sia una <b>gaussiana</b> centrata in \(t_i\), ovvero 
\[
  p \approx \mathcal{N}(t_i, 0)
  \]
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Data: 2022-03-25 ven 00:00</p>
<p class="author">Autore: Alessandro Straziota</p>
<p class="email">Email: <a href="mailto:alessandrostr95@gmail.com">alessandrostr95@gmail.com</a></p>
<p class="date">Created: 2022-03-31 gio 16:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
